JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1176/port_flexspi_info.c
                    case kFlexspi2_Ss1B_GPIO_AD_00:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_00_GPIO8_IO31, 0U);
                        GPIO_PinInit(GPIO8, 31, &do_config);
                        s_pinInfo[4].gpioGroup = 8;
                        s_pinInfo[4].gpioPin = 31;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.sclk)
            {
                switch (packet->memConnection.sclk)
                {
                    case kFlexspi2_SclkA_GPIO_EMC_B2_10:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_10_GPIO8_IO20, 0U);
                        GPIO_PinInit(GPIO8, 20, &do_config);
                        s_pinInfo[5].gpioGroup = 8;
                        s_pinInfo[5].gpioPin = 20;
                        break;
                    case kFlexspi2_SclkA_GPIO_SD_B1_01:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_GPIO10_IO04, 0U);
                        GPIO_PinInit(GPIO10, 4, &do_config);
                        s_pinInfo[5].gpioGroup = 10;
                        s_pinInfo[5].gpioPin = 4;
                        break;
                    case kFlexspi2_SclkB_GPIO_EMC_B2_09:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_09_GPIO8_IO19, 0U);
                        GPIO_PinInit(GPIO8, 19, &do_config);
                        s_pinInfo[5].gpioGroup = 8;
                        s_pinInfo[5].gpioPin = 19;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dqs0)
            {
                switch (packet->memConnection.dqs0)
                {
                    case kFlexspi2_DqsA_GPIO_EMC_B2_12:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_12_GPIO8_IO22, 0U);
                        GPIO_PinInit(GPIO8, 22, &do_config);
                        s_pinInfo[6].gpioGroup = 8;
                        s_pinInfo[6].gpioPin = 22;
                        break;
                    case kFlexspi2_DqsB_GPIO_EMC_B2_07:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_07_GPIO8_IO17, 0U);
                        GPIO_PinInit(GPIO8, 17, &do_config);
                        s_pinInfo[6].gpioGroup = 8;
                        s_pinInfo[6].gpioPin = 17;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dataHigh4bit)
            {
                switch (packet->memConnection.dataHigh4bit)
                {
                    case kFlexspi2_DataA_GPIO_EMC_B2_20_17:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_20_GPIO8_IO30, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_19_GPIO8_IO29, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_18_GPIO8_IO28, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_17_GPIO8_IO27, 0U);
                        GPIO_PinInit(GPIO8, 30, &do_config);
                        GPIO_PinInit(GPIO8, 29, &do_config);
                        GPIO_PinInit(GPIO8, 28, &do_config);
                        GPIO_PinInit(GPIO8, 27, &do_config);
                        s_pinInfo[7].gpioGroup = 8;
                        s_pinInfo[7].gpioPin = 30;
                        s_pinInfo[8].gpioGroup = 8;
                        s_pinInfo[8].gpioPin = 29;
                        s_pinInfo[9].gpioGroup = 8;
                        s_pinInfo[9].gpioPin = 28;
                        s_pinInfo[10].gpioGroup = 8;
                        s_pinInfo[10].gpioPin = 27;
                        break;
                    case kFlexspi2_DataB_GPIO_EMC_B1_41_B2_02_00:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_41_GPIO8_IO09, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_00_GPIO8_IO10, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_01_GPIO8_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_02_GPIO8_IO12, 0U);
                        GPIO_PinInit(GPIO8, 9, &do_config);
                        GPIO_PinInit(GPIO8, 10, &do_config);
                        GPIO_PinInit(GPIO8, 11, &do_config);
                        GPIO_PinInit(GPIO8, 12, &do_config);
                        s_pinInfo[7].gpioGroup = 8;
                        s_pinInfo[7].gpioPin = 9;
                        s_pinInfo[8].gpioGroup = 8;
                        s_pinInfo[8].gpioPin = 10;
                        s_pinInfo[9].gpioGroup = 8;
                        s_pinInfo[9].gpioPin = 11;
                        s_pinInfo[10].gpioGroup = 8;
                        s_pinInfo[10].gpioPin = 12;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dataTop8bit)
            {
            }
            if (packet->pintestEn.option.B.sclk_n)
            {
                switch (packet->memConnection.sclk_n)
                {
                    case kFlexspi2_SclkB_GPIO_EMC_B2_09:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_09_GPIO8_IO19, 0U);
                        GPIO_PinInit(GPIO8, 19, &do_config);
                        s_pinInfo[19].gpioGroup = 8;
                        s_pinInfo[19].gpioPin = 19;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dqs1)
            {
                switch (packet->memConnection.dqs1)
                {
                    case kFlexspi2_DqsB_GPIO_EMC_B2_07:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_07_GPIO8_IO17, 0U);
                        GPIO_PinInit(GPIO8, 17, &do_config);
                        s_pinInfo[20].gpioGroup = 8;
                        s_pinInfo[20].gpioPin = 17;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.rst_b)
            {
            }
        }
    }
    else
    {
        config_system_packet_t *packet = (config_system_packet_t *)configPacket;
        if (packet->memConnection.instance == 1)
        {
            switch (packet->memConnection.dataLow4bit)
            {
                case kFlexspi1_DataA_GPIO_SD_B2_11_08:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_A_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_A_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_A_DATA00, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_A_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_A_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_A_DATA03, pad_config);
                    break;
                case kFlexspi1_DataA_GPIO_AD_23_20:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_20_FLEXSPI1_A_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_21_FLEXSPI1_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_FLEXSPI1_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_FLEXSPI1_A_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_20_FLEXSPI1_A_DATA00, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_21_FLEXSPI1_A_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_22_FLEXSPI1_A_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_23_FLEXSPI1_A_DATA03, pad_config);
                    break;
                case kFlexspi1_DataB_GPIO_SD_B2_03_00:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_B_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_B_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_B_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_B_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_B_DATA00, pad_config);
                    break;
                case kFlexspi1_DataB_GPIO_AD_15_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_12_FLEXSPI1_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_FLEXSPI1_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_FLEXSPI1_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_FLEXSPI1_B_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_12_FLEXSPI1_B_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_13_FLEXSPI1_B_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_14_FLEXSPI1_B_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_15_FLEXSPI1_B_DATA00, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.ss_b)
            {
                case kFlexspi1_Ss0A_GPIO_SD_B2_06:
                    MTU_USE_FSPI1_PORTA1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B, pad_config);
                    break;
                case kFlexspi1_Ss0A_GPIO_AD_18:
                    MTU_USE_FSPI1_PORTA1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_18_FLEXSPI1_A_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_18_FLEXSPI1_A_SS0_B, pad_config);
                    break;
                case kFlexspi1_Ss1A_GPIO_SD_B1_02:
                    MTU_USE_FSPI1_PORTA2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_FLEXSPI1_A_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_02_FLEXSPI1_A_SS1_B, pad_config);
                    break;
                case kFlexspi1_Ss0B_GPIO_SD_B1_04:
                    MTU_USE_FSPI1_PORTB1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_FLEXSPI1_B_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_04_FLEXSPI1_B_SS0_B, pad_config);
                    break;
                case kFlexspi1_Ss1B_GPIO_AD_35:
                    MTU_USE_FSPI1_PORTB2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_35_FLEXSPI1_B_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_35_FLEXSPI1_B_SS1_B, pad_config);
                    break;
                case kFlexspi1_Ss1B_GPIO_SD_B1_03:
                    MTU_USE_FSPI1_PORTB2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_FLEXSPI1_B_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_03_FLEXSPI1_B_SS1_B, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk)
            {
                case kFlexspi1_SclkA_GPIO_SD_B2_07:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_A_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_A_SCLK, pad_config);
                    break;
                case kFlexspi1_SclkA_GPIO_AD_19:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_19_FLEXSPI1_A_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_19_FLEXSPI1_A_SCLK, pad_config);
                    break;
                case kFlexspi1_SclkB_GPIO_SD_B2_04:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_B_SCLK, pad_config);
                    break;
                case kFlexspi1_SclkB_GPIO_AD_16:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_16_FLEXSPI1_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_16_FLEXSPI1_B_SCLK, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs0)
            {
                case kFlexspi1_DqsA_GPIO_SD_B2_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_A_DQS, pad_config);
                    break;
                case kFlexspi1_DqsA_GPIO_AD_17:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_17_FLEXSPI1_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_17_FLEXSPI1_A_DQS, pad_config);
                    break;
                case kFlexspi1_DqsA_GPIO_EMC_B2_18:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_18_FLEXSPI1_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_18_FLEXSPI1_A_DQS, pad_config);
                    break;
                case kFlexspi1_DqsB_GPIO_SD_B1_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_B_DQS, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dataHigh4bit)
            {
                case kFlexspi1_DataB_GPIO_SD_B2_03_00:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_B_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_B_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_B_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_B_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_B_DATA00, pad_config);
                    break;
                case kFlexspi1_DataB_GPIO_AD_15_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_12_FLEXSPI1_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_FLEXSPI1_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_FLEXSPI1_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_FLEXSPI1_B_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_12_FLEXSPI1_B_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_13_FLEXSPI1_B_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_14_FLEXSPI1_B_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_15_FLEXSPI1_B_DATA00, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk_n)
            {
                case kFlexspi1_SclkB_GPIO_SD_B2_04:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_B_SCLK, pad_config);
                    break;
                case kFlexspi1_SclkB_GPIO_AD_16:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_16_FLEXSPI1_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_16_FLEXSPI1_B_SCLK, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs1)
            {
                case kFlexspi1_DqsB_GPIO_SD_B1_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_B_DQS, pad_config);
                    break;
                default:
                    break;
            }
        }
        else if (packet->memConnection.instance == 2)
        {
            switch (packet->memConnection.dataLow4bit)
            {
                case kFlexspi2_DataA_GPIO_EMC_B2_16_13:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_16_FLEXSPI2_A_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_15_FLEXSPI2_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_14_FLEXSPI2_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_13_FLEXSPI2_A_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_16_FLEXSPI2_A_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_15_FLEXSPI2_A_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_14_FLEXSPI2_A_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_13_FLEXSPI2_A_DATA00, pad_config);
                    break;
                case kFlexspi2_DataA_GPIO_SD_B1_05_02:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_FLEXSPI2_A_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_FLEXSPI2_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_FLEXSPI2_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_FLEXSPI2_A_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_05_FLEXSPI2_A_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_04_FLEXSPI2_A_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_03_FLEXSPI2_A_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_02_FLEXSPI2_A_DATA00, pad_config);
                    break;
                case kFlexspi2_DataB_GPIO_EMC_B2_06_03:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_06_FLEXSPI2_B_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_05_FLEXSPI2_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_04_FLEXSPI2_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_03_FLEXSPI2_B_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_06_FLEXSPI2_B_DATA00, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_05_FLEXSPI2_B_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_04_FLEXSPI2_B_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_03_FLEXSPI2_B_DATA03, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.ss_b)
            {
                case kFlexspi2_Ss0A_GPIO_EMC_B2_11:
                    MTU_USE_FSPI2_PORTA1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_11_FLEXSPI2_A_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_11_FLEXSPI2_A_SS0_B, pad_config);
                    break;
                case kFlexspi2_Ss0A_GPIO_SD_B1_00:
                    MTU_USE_FSPI2_PORTA1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_FLEXSPI2_A_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_00_FLEXSPI2_A_SS0_B, pad_config);
                    break;
                case kFlexspi2_Ss1A_GPIO_AD_01:
                    MTU_USE_FSPI2_PORTA2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_01_FLEXSPI2_A_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_01_FLEXSPI2_A_SS1_B, pad_config);
                    break;
                case kFlexspi2_Ss0B_GPIO_EMC_B2_08:
                    MTU_USE_FSPI2_PORTB1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_08_FLEXSPI2_B_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_08_FLEXSPI2_B_SS0_B, pad_config);
                    break;
                case kFlexspi2_Ss1B_GPIO_AD_00:
                    MTU_USE_FSPI2_PORTB2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_00_FLEXSPI2_B_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_00_FLEXSPI2_B_SS1_B, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk)
            {
                case kFlexspi2_SclkA_GPIO_EMC_B2_10:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_10_FLEXSPI2_A_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_10_FLEXSPI2_A_SCLK, pad_config);
                    break;
                case kFlexspi2_SclkA_GPIO_SD_B1_01:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_FLEXSPI2_A_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_01_FLEXSPI2_A_SCLK, pad_config);
                    break;
                case kFlexspi2_SclkB_GPIO_EMC_B2_09:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_09_FLEXSPI2_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_09_FLEXSPI2_B_SCLK, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs0)
            {
                case kFlexspi2_DqsA_GPIO_EMC_B2_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_12_FLEXSPI2_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_12_FLEXSPI2_A_DQS, pad_config);
                    break;
                case kFlexspi2_DqsB_GPIO_EMC_B2_07:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_07_FLEXSPI2_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_07_FLEXSPI2_B_DQS, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dataHigh4bit)
            {
                case kFlexspi2_DataA_GPIO_EMC_B2_20_17:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_20_FLEXSPI2_A_DATA07, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_19_FLEXSPI2_A_DATA06, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_18_FLEXSPI2_A_DATA05, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_17_FLEXSPI2_A_DATA04, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_20_FLEXSPI2_A_DATA07, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_19_FLEXSPI2_A_DATA06, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_18_FLEXSPI2_A_DATA05, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_17_FLEXSPI2_A_DATA04, pad_config);
                    break;
                case kFlexspi2_DataB_GPIO_EMC_B1_41_B2_02_00:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_41_FLEXSPI2_B_DATA07, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_00_FLEXSPI2_B_DATA06, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_01_FLEXSPI2_B_DATA05, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_02_FLEXSPI2_B_DATA04, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_41_FLEXSPI2_B_DATA07, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_00_FLEXSPI2_B_DATA06, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_01_FLEXSPI2_B_DATA05, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_02_FLEXSPI2_B_DATA04, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk_n)
            {
                case kFlexspi2_SclkB_GPIO_EMC_B2_09:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_09_FLEXSPI2_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_09_FLEXSPI2_B_SCLK, pad_config);
