JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1176/port_flexspi_info.c
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs1)
            {
                case kFlexspi2_DqsB_GPIO_EMC_B2_07:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_07_FLEXSPI2_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_07_FLEXSPI2_B_DQS, pad_config);
                    break;
                default:
                    break;
            }
        }
    }
}

void bsp_mixspi_gpios_toggle(void)
{
    if (s_pinUnittestPacket.pintestEn.enableAdcSample)
    {
        uint8_t convValue = bsp_adc_get_conv_value();
        mtu_uart_sendhex(&convValue, sizeof(convValue));
    }
  
    GPIO_Type *gpioBase[] = GPIO_BASE_PTRS;
    for (uint32_t i = 0; i < sizeof(s_pinInfo) / sizeof(pin_info_t); i++)
    {
        if (s_pinInfo[i].gpioGroup != 0xFFFFu)
        {
            GPIO_PortToggle(gpioBase[s_pinInfo[i].gpioGroup], 1u << s_pinInfo[i].gpioPin);
        }
    }
}

void bsp_mixspi_clock_init(void *config)
{
    clock_root_config_t rootCfg = {0};
    mixspi_user_config_t *userConfig = (mixspi_user_config_t *)config;
    mixspi_root_clk_freq_t clkFreq = userConfig->mixspiRootClkFreq;
    uint8_t kCLOCK_FLEXSPIx_ClockRoot_MuxOscRc48MDiv2;
    uint8_t kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
    uint8_t kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll2Pfd2;
    clock_root_t clockRoot;
    if (userConfig->mixspiBase == FLEXSPI1)
    {
        userConfig->instance = 1;
        clockRoot = kCLOCK_Root_Flexspi1;
        kCLOCK_FLEXSPIx_ClockRoot_MuxOscRc48MDiv2 = kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc48MDiv2;
        kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0  = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
        kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll2Pfd2  = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd2;
    }
    else if (userConfig->mixspiBase == FLEXSPI2)
    {
        userConfig->instance = 2;
        clockRoot = kCLOCK_Root_Flexspi2;
        kCLOCK_FLEXSPIx_ClockRoot_MuxOscRc48MDiv2 = kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc48MDiv2;
        kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0  = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd0;
        kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll2Pfd2  = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd2;
    }
    else
    {
    }
    // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 12-35.
    if (clkFreq == kMixspiRootClkFreq_30MHz)
    {
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxOscRc48MDiv2;
        rootCfg.div = 1;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_50MHz)
    {
        /* Init System Pll2 (528MHz) pfd2. */
        // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        // CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd2, 24);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll2Pfd2;
        rootCfg.div = 8;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_60MHz)
    {
        /* Init System Pll3 (480MHz) pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
        rootCfg.div = 8;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_80MHz)
    {
        /* Init System Pll3 (480MHz) pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
        rootCfg.div = 6;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_100MHz)
    {
        /* Init System Pll2 (528MHz) pfd2. */
        // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        // CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd2, 24);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll2Pfd2;
        rootCfg.div = 4;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_120MHz)
    {
        /* Init System Pll3 (480MHz) pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
        rootCfg.div = 4;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_133MHz)
    {
        /* Init System Pll3 (480MHz) pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        //CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 13);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
        rootCfg.div = 5;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_166MHz)
    {
        /* Init System Pll3 (480MHz) pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        //CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 13);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
        rootCfg.div = 4;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_200MHz)
    {
        /* Init System Pll3 (480MHz) pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 22);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
        rootCfg.div = 2;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_240MHz)
    {
        /* Init System Pll3 (480MHz) pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
        rootCfg.div = 2;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_266MHz)
    {
        /* Init System Pll2 (528MHz) pfd2. */
        // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd2, 18);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll2Pfd2;
        rootCfg.div = 2;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_332MHz)
    {
        /* Init System Pll3 (480MHz) pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        //CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 13);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
        rootCfg.div = 2;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else if (clkFreq == kMixspiRootClkFreq_400MHz)
    {
        /* Init System Pll3 (480MHz) pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 22);
        rootCfg.mux = kCLOCK_FLEXSPIx_ClockRoot_MuxSysPll3Pfd0;
        rootCfg.div = 1;
        CLOCK_SetRootClock(clockRoot, &rootCfg);
    }
    else
    {
        printf("FLEXSPI1 clock freq is not set.\r\n");
    }

    uint32_t flexspiClk = CLOCK_GetRootClockFreq(clockRoot);
    if (flexspiClk > 166000000U)
    {
        __NOP();
    }
}

